In [1]:
import numpy as np 
import pandas as pd  
import matplotlib.pyplot as plt
from sklearn.datasets import make_blobs
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler, MinMaxScaler

In [2]:
# Import dataframes 
file_members= "members_v3.csv"
file_train="train_v2.csv"
file_transactions="transactions_v2.csv"
file_log="user_logs_v2.csv"

members_df=pd.read_csv(file_members)
train_df=pd.read_csv(file_train)
transactions_df=pd.read_csv(file_transactions)
log_df=pd.read_csv(file_log)

In [18]:
log_df.shape

(18396362, 9)

In [20]:
transactions_df.shape

(1431009, 9)

In [14]:
df3 = members_df.merge(log_df, on=['msno'], how='inner')

,msno,city,bd,gender,registered_via,registration_init_time,date,num_25,num_50,num_75,num_985,num_100,num_unq,total_secs
0,+tJonkh+O1CA796Fm5X60UMOtB6POHAwPjbTRVl/EuU=,1,0,NaN,7,20110914,20170325,4,2,0,1,16,20,4105.797
1,+tJonkh+O1CA796Fm5X60UMOtB6POHAwPjbTRVl/EuU=,1,0,NaN,7,20110914,20170328,5,1,2,0,37,12,12165.187
2,+tJonkh+O1CA796Fm5X60UMOtB6POHAwPjbTRVl/EuU=,1,0,NaN,7,20110914,20170327,15,8,4,1,107,27,30361.560
3,+tJonkh+O1CA796Fm5X60UMOtB6POHAwPjbTRVl/EuU=,1,0,NaN,7,20110914,20170319,14,3,6,5,127,55,35368.322
4,+tJonkh+O1CA796Fm5X60UMOtB6POHAwPjbTRVl/EuU=,1,0,NaN,7,20110914,20170321,14,2,0,0,38,35,9913.278

In [22]:
#Find null values in df3
df3.isnull().sum()

msno                            0
city                            0
bd                              0
gender                    8002753
registered_via                  0
registration_init_time          0
date                            0
num_25                          0
num_50                          0
num_75                          0
num_985                         0
num_100                         0
num_unq                         0
total_secs                      0
dtype: int64

In [23]:
df3.shape

(18395950, 14)

In [25]:
#Removing null values 
df3.dropna(inplace = True)
df3.isnull().sum()

msno                      0
city                      0
bd                        0
gender                    0
registered_via            0
registration_init_time    0
date                      0
num_25                    0
num_50                    0
num_75                    0
num_985                   0
num_100                   0
num_unq                   0
total_secs                0
dtype: int64

In [26]:
df3.shape

(10393197, 14)

In [29]:
df4 = members_df.merge(transactions_df, on=['msno'], how='inner')

In [30]:
df4.shape

(1303156, 14)

In [31]:
#Find null values in df4
df3.isnull().sum()

msno                      0
city                      0
bd                        0
gender                    0
registered_via            0
registration_init_time    0
date                      0
num_25                    0
num_50                    0
num_75                    0
num_985                   0
num_100                   0
num_unq                   0
total_secs                0
dtype: int64

In [49]:
df5= df3.merge(df4, on=['msno'], how='inner')

In [50]:
for col in df5.columns:
    print(col)

msno
city_x
bd_x
gender_x
registered_via_x
registration_init_time_x
date
num_25
num_50
num_75
num_985
num_100
num_unq
total_secs
city_y
bd_y
gender_y
registered_via_y
registration_init_time_y
payment_method_id
payment_plan_days
plan_list_price
actual_amount_paid
is_auto_renew
transaction_date
membership_expire_date
is_cancel

In [51]:
df5=df5.drop(['city_y','bd_y','gender_y','registered_via_y','registration_init_time_y'],axis=1)

In [52]:
for col in df5.columns:
    print(col)

msno
city_x
bd_x
gender_x
registered_via_x
registration_init_time_x
date
num_25
num_50
num_75
num_985
num_100
num_unq
total_secs
payment_method_id
payment_plan_days
plan_list_price
actual_amount_paid
is_auto_renew
transaction_date
membership_expire_date
is_cancel

In [53]:
df5.to_csv('df5.csv',index=False)